{
  "activeJar": "assets/jars/TSCreatorBASE-8.1_11July2024.jar",
  "activeDatapacks": [
    {
      "title": "TSC2020 Internal Datapack",
      "description": "TimeScaleCreator Internal Datapack",
      "file": "TSC2020_InternalDatapack_encrypted_13Feb2021.txt",
      "size": "5.01 MB"
    },
    {
      "title": "Hominids with Images GTS2020",
      "description":"(encoded zip file, 0.5Mb, 5 columns, includes 20 images). Tool intervals, main Homo and Australopithecus ranges (ca. 5 Ma, includes images) and major events in Primate evolution (ca. 50 Ma). Pop-ups have detailed informtion and links. [Images courtesy of American Museum of History and Smithsonian, Jan. 2021.] [NOTE: Suggest beginning with 0.05 to 2 Ma with vertical scale of 8.]",
      "file": "Hominids_wImages_GTS2020_Encrypted.dpk",
      "size": "399.78 KB"
    },
    {
      "title": "Australia Mappack",
      "description": "Australian biostratigraphy and basin lithostratigraphy with map interface and reconstructions.(encrypted zippack, 15 Mb, ca. 500 columns, includes 125 reconstructions and facies maps). Detailed Table of contents and references at AustraliaMappack_Contents_12July2016.pdf. Geoscience Australia has compiled the following: (1) Regional biostratigraphy (70 columns) with complete references, and (2) Detailed lithostratigraphy for all hydrocarbon-rich basins (including oil-gas levels with reference wells) (ca. 300 columns), and we added (3) Precambrian and other Phanerozoic basins (150 columns). Each lithology formation has pop-ups that include URL-links to the GA lexicon, the header for each Phanerozoic basin has links to location maps, and all oil-gas levels are linked to the GA well database. [NOTE: Contact Andrew Kelman <Andrew.Kelman@ga.gov.au> for a special Public 'GA-TS_Creator' JAVA version (ca. 25 Mb) that has this Australian dataset and their extensive reconstruction images pre-installed with the full global suite.]",
      "file": "Australia Mappack GTS2016 ENCRYPTED PUBLIC.mdpk",
      "size": "15.05 MB"
    },
    {
      "title": "Belgium",
      "description": "Belgium regional formations with map interface. (encrypted mappack, 2Mb, 20 columns). Detailed Table of contents and references at Belgium_LithostratContents.pdf. Compiled by Jane Block in coordination with Belgium Stratigraphic Commission (Noel Vandenberghe, Hance Luc, et al.)",
      "file": "Belgium_GTS2020.mdpk",
      "size": "2.19 MB"
    },
    {
      "title": "South America",
      "description": "South American regional formations with map interface. (encrypted zippack, 5Mb, ca. 50 columns). Detailed Table of contents and references at SouthAmericaEncrypted_29Apr2019.pdf. Compiled by Jane Block in coordination with South American Stratigraphic Commission (Carlos Schobbenhaus, et al.)",
      "file": "SouthAmericaEncrypted_29Apr2019.mdpk",
      "size": "52.43"
    },
    {
      "title": "Africa Bight",
      "description": "Africa Bight Map",
      "file": "AfricaBight.map",
      "size": "200.98 KB"
    },
    {
      "title": "British Mappack GTS2016",
      "description": "British Isles regional formations with map interface. (encrypted zippack, 3Mb, ca. 25 columns). Detailed Table of contents and references at UK_lithostrat_contents_30Nov12.pdf. Approximately two dozen sub-regions, with each formation linked to the BGS lexicon; compiled in coordination with British Geological Survey, BGS.",
      "file": "British_Suite_wWiderColumns_GTS2020_5July2024.mdpk",
      "size": "1.9 MB"
    },
    {
      "title": "TimeTree of Life GTS2020",
      "description": "TimeTree of Life (encoded zip file, 0.5Mb, 5 columns). Major events in the history of life on Earth (ca. 3.5 Ga). Pop-ups have detailed information and links.",
      "file": "TimeTree_of_Life_GTS2020_ENCRYPTED_23Jan2020.dpk",
      "size": "14.19 MB"
    }
  ],
  "decryptionJar": "assets/jars/datapack-decrypter_21Jun2024.jar",
  "decryptionDirectory": "assets/decrypted",
  "datapacksDirectory": "assets/datapacks",
  "chartsDirectory": "public/charts",
  "imagesDirectory": "public/mapimages",
  "patternsDirectory": "public/patterns",
  "colors": "assets/colors.json",
  "timescaleFilepath": "assets/default_timescale.xlsx",
  "fileMetadata": "assets/file_metadata.json",
  "uploadDirectory": "assets/uploads",
  "datapackImagesDirectory": "assets/datapack_images",
  "adminConfigPath": "assets/admin-config.json"
}